Revit 2027 API
RebarConstrainedHandle.CanSetBehavior Method
 Checks if the input behavior can be set for this RebarConstrainedHandle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSetBehavior(
	RebarHandleBehavior handleBehavior
)
Public Function CanSetBehavior (
	handleBehavior As RebarHandleBehavior
) As Boolean
public:
bool CanSetBehavior(
	RebarHandleBehavior handleBehavior
)
member CanSetBehavior :
        handleBehavior : RebarHandleBehavior -> bool
Parameters
handleBehavior RebarHandleBehavior
 The behavior to be checked.
Return Value
Boolean
 Returns true if the input behavior can be set for this RebarConstrainedHandle, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace